/*
Продажа недвижимости.Некоторое агентство ведет базу данных продаваемой недвижимости.
Все виды недвижимости имеют свойства - адрес, цена, площадь.
Недвижимость бывает трех типов : жилая(тип дома, количество комнат, жилая площадь),
производственная(назначение, оборудование) и склады(вместимость, отопление).

Автор: Шушков А.В
Группа: ПИ-11д
Лаб.работа: 2.1
Вариант: 25
Дата: 02.05.2022

*/
#include <iostream>
#include <iomanip>
#include <locale.h>
using namespace std;


int main()
{
	setlocale(LC_ALL, "Russian");
}

